app/views/static_pages/_card.html.erb

          <h3 class="card__title"><%=manga.manga.title%></h3>
          <% manga.manga.categories.each do |category| %>
---
SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = $1 LIMIT $2  [["id", 140], ["LIMIT", 1]]