app/views/library_items/_libraryItemsCard.html.erb

SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = $1 LIMIT $2  [["id", 122], ["LIMIT", 1]]
---
									<p><small><em>possédé par </em> <%= item.user.name %></small></p>
									<% item.manga.categories.each do |category| %>