app/views/library_items/show.html.erb

     <ul class="ml-5">
        <% @item.user.mangas.each do |manga| %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 10], ["LIMIT", 1]]
SELECT "mangas".* FROM "mangas" INNER JOIN "library_items" ON "mangas"."id" = "library_items"."manga_id" WHERE "library_items"."user_id" = $1  [["user_id", 7]]