app/controllers/library_items_controller.rb

SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def index
        @pagy, @items = pagy(LibraryItem.all)
        @categories = Category.all

        @all_libraries = []
        LibraryItem.all.each{|item| @all_libraries << item.manga.id}