app/controllers/library_items_controller.rb

    def show
        @item = LibraryItem.find(params[:id])
---
SELECT  "library_items".* FROM "library_items" WHERE "library_items"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]

    def create
        puts "Hola!!"
        puts params
        @item = LibraryItem.create(state_description: "une description", user: current_user, manga_id:params[:manga_id])
---
INSERT INTO "library_items" ("state_description", "user_id", "manga_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["state_description", "une description"], ["user_id", 9], ["manga_id", 3], ["created_at", "2020-12-04 10:53:50.879455"], ["updated_at", "2020-12-04 10:53:50.879455"]]

    def destroy
        @item = LibraryItem.find(params[:id])
        #@manga = Manga.find(params[:manga_id])
        #@item = LibraryItem.where(user: current_user, manga_id:@manga.id)

        puts @item
        puts "Hello"

        @item.destroy
---
SELECT  "library_items".* FROM "library_items" WHERE "library_items"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "library_items" WHERE "library_items"."id" = $1  [["id", 7]]