app/controllers/mangas_controller.rb

SELECT  "mangas".* FROM "mangas" WHERE "mangas"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT "library_items".* FROM "library_items" WHERE "library_items"."manga_id" = $1  [["manga_id", 35]]
---
  def show
    @manga = Manga.find(params[:id])
    @items = LibraryItem.where(manga:@manga)

INSERT INTO "mangas" ("title", "author", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Mon 3e manga"], ["author", "Iam"], ["description", "Pas d'image"], ["created_at", "2020-12-02 17:56:46.128413"], ["updated_at", "2020-12-02 17:56:46.128413"]]
---
  def create
    manga = Manga.create(manga_params)