app/controllers/static_pages_controller.rb

SELECT  "library_items".* FROM "library_items" ORDER BY "library_items"."id" DESC LIMIT $1  [["LIMIT", 5]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" DESC LIMIT $1  [["LIMIT", 3]]
---
  def index
    @manga = LibraryItem.last(4)
    @user = User.last(3)