app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "library_items".* FROM "library_items" WHERE "library_items"."user_id" = $1  [["user_id", 14]]
---
  def show
    @user = User.find(params[:id])
    @user_collection = LibraryItem.where(user: current_user)

SELECT  "library_items".* FROM "library_items" WHERE "library_items"."user_id" = $1 LIMIT $2  [["user_id", 2], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def edit
    @user_collection = LibraryItem.where(user: current_user)
    @user = User.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "Julio"], ["updated_at", "2020-12-04 10:08:23.429446"], ["id", 9]]
---
  def update
    @user = User.find(params[:id])
    if @user.update(name: params[:user][:name])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
---
  def is_user?
    @user = User.find(params[:id])